xiafuning/nrf52840-dongle-applications/wireless_usb_cdc_acm/fsm.c
/**
 * Copyright (c) 2016 - 2019 Nordic Semiconductor ASA and Luxoft Global Operations Gmbh.
 *
 * All Rights Reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
#include "config.h"

#include "fsm.h"
#include "uart.h"
#include "usb_cdc_acm.h"
#if (CONFIG_SECURE == 1)
#include "security.h"
#endif
#include "sys_fsm.h"
#include "sys_utils.h"
#include "sys_memory_manager.h"
#include "sys_debug.h"
#include "sys_task_scheduler.h"
#include "boards.h"
#include "nrf_gpio.h"
#include <stdint.h>
#include <stddef.h>

#include "app_usbd_cdc_acm.h"	// XFN_CHANGE
#include "bsp.h"				// XFN_CHANGE
#include "serial.h"

#define LED_USB_RESUME      (BSP_BOARD_LED_0)
#define LED_CDC_ACM_OPEN    (BSP_BOARD_LED_1)
#define LED_CDC_ACM_RX      (BSP_BOARD_LED_2)
#define LED_CDC_ACM_TX      (BSP_BOARD_LED_3)

#define MAC_MAX_RETRIES     3

typedef struct
{
    mac_payload_descriptor_t   payload_descr;
    uint8_t                    length;
} fsm_frame_item_t;

typedef enum
{
    S_INITIAL,
    S_SETTING_CH,
    S_SETTING_SHORT_ADDR,
    S_SETTING_EXT_ADDR,
    S_SETTING_PAN_ID,
    S_SETTING_RX_ON_IDLE,
    S_SETTING_SECURITY,
    S_WORKING,
} fsm_states_t;

typedef enum
{
    GU_SET_SUCCESS,
    GU_SEND_SUCCESS,
    GU_RADIO_TX_IDLE,
    GU_USB_CDC_ACM_TX_DATA_AVAILABLE,	// XFN_CHANGE
    GU_USB_CDC_ACM_TX_IDLE,				// XFN_CHANGE
    GU_RADIO_MAX_RETRIES,               // XFN_CHANGE
} fsm_guards_t;

typedef enum
{
    A_CHANNEL_SET,
    A_SHORT_ADDR_SET,
    A_EXT_ADDR_SET,
    A_PAN_ID_SET,
    A_RX_ON_IDLE_SET,
    A_CONFIG_COMPLETE,
    A_RADIO_TX_START,
    A_RADIO_TX_RESTART,
    A_UART_TX_START,
    A_UART_TX_IDLE_SET,
#if (CONFIG_SECURE == 1)
    A_SECURITY_SET
#endif
    A_USB_CDC_ACM_TX_START,		// XFN_CHANGE
    A_USB_CDC_ACM_TX_IDLE_SET,	// XFN_CHANGE
    A_MCPS_DATA_CONF_SEND,      // XFN_CHANGE
} fsm_actions_t;

typedef void (* fsm_action_t)(void *);
typedef bool (* fsm_guard_t)(void *);
typedef void (* app_action_t)(void);

typedef void (* store_data_handler_t)(fsm_event_data_t *);

// prototypes
static void fsm_action(sys_fsm_action_id_t action_id, void * p_data);
static bool fsm_guard(sys_fsm_guard_id_t guard_id, void * p_data);

static void a_channel_set(void * p_data);
static void a_short_addr_set(void * p_data);
static void a_ext_addr_set(void * p_data);
static void a_pan_id_set(void * p_data);
static void a_rx_on_idle_set(void * p_data);
static void a_config_complete(void * p_data);
static void a_radio_tx_start(void * p_data);
static void a_radio_tx_restart(void * p_data);
static void a_uart_tx_start(void * p_data);
static void a_uart_tx_idle_set(void * p_data);
#if (CONFIG_SECURE == 1)
static void a_security_set(void * p_data);
#endif
static void a_usb_cdc_acm_tx_start(void * p_data);		// XFN_CHANGE
static void a_usb_cdc_acm_tx_idle_set(void * p_data);	// XFN_CHANGE
static void a_mcps_data_conf_send(void * p_data);	    // XFN_CHANGE

static bool gu_set_success(void * p_data);
static bool gu_send_success(void * p_data);
static bool gu_radio_tx_idle(void * p_data);
static bool gu_usb_cdc_acm_tx_data_available(void * p_data);	// XFN_CHANGE
static bool gu_usb_cdc_acm_tx_idle(void * p_data);				// XFN_CHANGE
static bool gu_radio_max_retries(void * p_data);                // XFN_CHANGE

static bool frames_available(void);

static void mlme_set_conf_store(fsm_event_data_t * p_data);
static void mcps_data_ind_store(fsm_event_data_t * p_data);
static void mcps_data_conf_store(fsm_event_data_t * p_data);

static void mcps_data_conf(mcps_data_conf_t * conf);
static void mlme_set_conf(mlme_set_conf_t * conf);

static const sys_fsm_transition_t m_transition_table[] =
{
    SYS_FSM_STATE     ( S_WORKING ),
    SYS_FSM_TRANSITION( E_SET_DONE,          SYS_FSM_ALWAYS,            A_CONFIG_COMPLETE,             SYS_FSM_SAME_STATE ),
    //SYS_FSM_TRANSITION( E_UART_TX_DONE,      GU_UART_TX_DATA_AVAILABLE, A_UART_TX_START,               SYS_FSM_SAME_STATE ),
    //SYS_FSM_TRANSITION( E_UART_TX_DONE,      SYS_FSM_OTHERWISE,         A_UART_TX_IDLE_SET,            SYS_FSM_SAME_STATE ),
    //SYS_FSM_TRANSITION( E_UART_RX_DONE,      GU_RADIO_TX_IDLE,          A_RADIO_TX_START,              SYS_FSM_SAME_STATE ),
    SYS_FSM_TRANSITION( E_RADIO_RX_DONE,     GU_USB_CDC_ACM_TX_IDLE,	A_USB_CDC_ACM_TX_START,        SYS_FSM_SAME_STATE ),	// XFN_CHANGE
    SYS_FSM_TRANSITION( E_RADIO_TX_DONE,     GU_SEND_SUCCESS,           A_RADIO_TX_START,              SYS_FSM_SAME_STATE ),
    SYS_FSM_TRANSITION( E_RADIO_TX_DONE,     SYS_FSM_OTHERWISE,         A_RADIO_TX_RESTART,            SYS_FSM_SAME_STATE ),
	// XFN_CHANGE
    SYS_FSM_TRANSITION( E_USB_CDC_ACM_TX_DONE,	GU_USB_CDC_ACM_TX_DATA_AVAILABLE,	A_USB_CDC_ACM_TX_START,		SYS_FSM_SAME_STATE ),
    SYS_FSM_TRANSITION( E_USB_CDC_ACM_TX_DONE,	SYS_FSM_OTHERWISE,					A_USB_CDC_ACM_TX_IDLE_SET,	SYS_FSM_SAME_STATE ),
    SYS_FSM_TRANSITION( E_USB_CDC_ACM_RX_DONE,	GU_RADIO_TX_IDLE,					A_RADIO_TX_START,			SYS_FSM_SAME_STATE ),
    SYS_FSM_TRANSITION( E_RADIO_TX_SUCCESS,     GU_USB_CDC_ACM_TX_IDLE,             A_MCPS_DATA_CONF_SEND,      SYS_FSM_SAME_STATE ),
    SYS_FSM_TRANSITION( E_RADIO_TX_NO_ACK,      GU_RADIO_MAX_RETRIES,               A_MCPS_DATA_CONF_SEND,      SYS_FSM_SAME_STATE ),
    SYS_FSM_TRANSITION( E_RADIO_TX_NO_ACK,      SYS_FSM_OTHERWISE,                  A_RADIO_TX_RESTART,         SYS_FSM_SAME_STATE ),

    SYS_FSM_STATE     ( S_INITIAL ),
    SYS_FSM_TRANSITION( E_START_CONFIG,      SYS_FSM_ALWAYS,            A_CHANNEL_SET,                 S_SETTING_CH ),

    SYS_FSM_STATE     ( S_SETTING_CH ),
    SYS_FSM_TRANSITION( E_SET_DONE,          GU_SET_SUCCESS,            A_SHORT_ADDR_SET,              S_SETTING_SHORT_ADDR ),

    SYS_FSM_STATE     ( S_SETTING_SHORT_ADDR ),
    SYS_FSM_TRANSITION( E_SET_DONE,          GU_SET_SUCCESS,            A_EXT_ADDR_SET,                S_SETTING_EXT_ADDR ),

    SYS_FSM_STATE     ( S_SETTING_EXT_ADDR ),
    SYS_FSM_TRANSITION( E_SET_DONE,          GU_SET_SUCCESS,            A_PAN_ID_SET,                  S_SETTING_PAN_ID ),
#if (CONFIG_SECURE == 1)
    SYS_FSM_STATE     ( S_SETTING_PAN_ID ),
    SYS_FSM_TRANSITION( E_SET_DONE,          GU_SET_SUCCESS,            A_RX_ON_IDLE_SET,              S_SETTING_RX_ON_IDLE ),

