xiafuning/nrf52840-dongle-applications/wireless_usb_cdc_acm/fsm.c
	/*
    const hal_uart_descriptor_t * p_descr = uart_descr_get();
    size_t sz = hal_uart_read_buffer_size_get(p_descr);
    //LEDS_OFF(BIT(CONFIG_UPSTREAM_PIN));
	*/

	// XFN_CHANGE
	app_usbd_cdc_acm_t const * p_usb_cdc_acm = usb_cdc_acm_inst_get();
	ret_code_t ret;
	extern char m_rx_buffer[];

	if ((app_usbd_cdc_acm_bytes_stored(p_usb_cdc_acm) > 0) ||
        ((app_usbd_cdc_acm_bytes_stored(p_usb_cdc_acm) == 0) && m_rx_buffer[0] != 0))
	{
		if (m_rx_buffer[0] == 1) // receive first serial fragment
        {
            bsp_board_led_invert(LED_CDC_ACM_OPEN);
            m_radio_tx_size = 0;
            memset (m_radio_tx_buffer, 0, sizeof m_radio_tx_buffer);
            do
		    {
                /* Fetch data until internal buffer is empty */
			    ret = app_usbd_cdc_acm_read(p_usb_cdc_acm, m_rx_buffer, READ_SIZE);

			    memcpy(&m_radio_tx_buffer[PAYLOAD_START_POSITION + m_radio_tx_size], &m_rx_buffer[0], READ_SIZE);
			    m_radio_tx_size++;
			    if (m_radio_tx_size == MAX_MSDU_SIZE)
				    break;
		    }
		    while (ret == NRF_SUCCESS);
            // bias adjustment
            m_radio_tx_size--;
            // reset rx buffer
		    memset (m_rx_buffer, 0, sizeof m_rx_buffer);
            fsm_event_post(E_RADIO_TX_DONE, NULL);
            return;
        }
        else if (m_rx_buffer[0] == 2) // receive second serial fragment
        {
            bsp_board_led_invert(LED_CDC_ACM_OPEN);
            do
		    {
                /* Fetch data until internal buffer is empty */
			    ret = app_usbd_cdc_acm_read(p_usb_cdc_acm, m_rx_buffer, READ_SIZE);

			    memcpy(&m_radio_tx_buffer[PAYLOAD_START_POSITION + m_radio_tx_size], &m_rx_buffer[0], READ_SIZE);
			    m_radio_tx_size++;
			    if (m_radio_tx_size == MAX_MSDU_SIZE)
		        	break;
		    }
		    while (ret == NRF_SUCCESS);
            // bias adjustment
            m_radio_tx_size--;
            // reset rx buffer
		    memset (m_rx_buffer, 0, sizeof m_rx_buffer);
        }
        else // receive normal payload
        {
            m_radio_tx_size = 0;
            memset (m_radio_tx_buffer, 0, sizeof m_radio_tx_buffer);
            do
            {
        	    memcpy(&m_radio_tx_buffer[PAYLOAD_START_POSITION + m_radio_tx_size], &m_rx_buffer[0], READ_SIZE);
			    m_radio_tx_size++;
			    if (m_radio_tx_size == MAX_MSDU_SIZE)
				    break;
			    /* Fetch data until internal buffer is empty */
			    ret = app_usbd_cdc_acm_read(p_usb_cdc_acm, m_rx_buffer, READ_SIZE);
            }
            while (ret == NRF_SUCCESS);
            // reset rx buffer
		    memset (m_rx_buffer, 0, sizeof m_rx_buffer);
        }

		// copy sequence number
        memcpy(&m_radio_tx_buffer[COUNTER_POSITION], &tx_sequence_number, MAX_APP_SEQUENCE_NUMBER_SIZE);
#if (CONFIG_SECURE == 1)
        memcpy(m_radio_tx_buffer_shadow, &m_radio_tx_buffer[COUNTER_POSITION],
                                            size + MAX_APP_SEQUENCE_NUMBER_SIZE);
#endif

		// radio mac configuration
        m_data_req.dst_addr_mode = MAC_ADDR_SHORT;
        m_data_req.dst_addr.short_address = CONFIG_OTHER_ADDRESS;
        m_data_req.dst_pan_id = CONFIG_PAN_ID;
        m_data_req.src_addr_mode = MAC_ADDR_SHORT;
        m_data_req.msdu = (uint8_t *)&m_radio_tx_buffer[PAYLOAD_START_POSITION];
        m_data_req.msdu_length = m_radio_tx_size;
        m_data_req.msdu_handle++;
        m_data_req.tx_options.ack = true;	// XFN_CHANGE, original value: true
        m_data_req.tx_options.gts = false;
        m_data_req.tx_options.indirect = false;
#if (CONFIG_SECURE == 1)
        m_data_req.security_level = CONFIG_DATA_SECURITY_LEVEL;
        m_data_req.key_id_mode = 0;
#endif
		// raise a request to transfer a data SPDU (i.e., MSDU)
		mcps_data_req(&m_data_req, mcps_data_conf);
        //LEDS_ON(BIT(CONFIG_UPSTREAM_PIN));
    }
    else
    {
        m_radio_tx_idle = true;
    }
}

static void a_config_complete(void * p_data)
{
    //LEDS_ON(BIT(CONFIG_INIT_DONE_PIN));
}

static void a_radio_tx_restart(void * p_data)
{
#if (CONFIG_SECURE == 1)
    /** This is necessary because data in m_radio_tx_buffer had been already ciphered. */
    memcpy(&m_radio_tx_buffer[COUNTER_POSITION], m_radio_tx_buffer_shadow, m_data_req.msdu_length);
#endif
    m_data_req.msdu_handle++;
    mcps_data_req(&m_data_req, mcps_data_conf);
    //LEDS_ON(BIT(CONFIG_UPSTREAM_PIN));
}

static bool frames_available(void)
{
    return m_radio_rx_array_read_index != m_radio_rx_array_write_index;
}

static void frame_store(fsm_frame_item_t * p_frame)
{
    m_radio_rx_array[m_radio_rx_array_write_index++] = *p_frame;
    if (m_radio_rx_array_write_index == ARRAY_SIZE(m_radio_rx_array))
    {
        m_radio_rx_array_write_index = 0;
    }
    ASSERT(frames_available());
}

static fsm_frame_item_t * next_frame_get(void)
{
    ASSERT(frames_available());
    fsm_frame_item_t * result = &m_radio_rx_array[m_radio_rx_array_read_index++];
    if (m_radio_rx_array_read_index == ARRAY_SIZE(m_radio_rx_array))
    {
        m_radio_rx_array_read_index = 0;
    }
    return result;
}

static void a_uart_tx_start(void * p_data)
{
    ASSERT(frames_available());

    fsm_frame_item_t * p_fsm_frame = next_frame_get();
    const hal_uart_descriptor_t * p_uart_descr = uart_descr_get();

    hal_uart_write(p_uart_descr,
                   p_fsm_frame->payload_descr.p_payload + MAX_APP_SEQUENCE_NUMBER_SIZE,
                   p_fsm_frame->length - MAX_APP_SEQUENCE_NUMBER_SIZE);

    mac_mem_msdu_free(&p_fsm_frame->payload_descr);

    m_uart_tx_idle = false;

    //LEDS_ON(BIT(CONFIG_DOWNSTREAM_PIN));

    (void)p_data;
}

static void a_uart_tx_idle_set(void * p_data)
{
    m_uart_tx_idle = true;
}

#if (CONFIG_SECURE == 1)
static void a_security_set(void * p_data)
{
    security_tables_init();
    fsm_event_post(E_SECURITY_SET, NULL);
}
#endif


/* callback functions */

static void mlme_set_conf(mlme_set_conf_t * conf)
{
    fsm_event_data_t data =
    {
        .mlme_set = conf,
    };
    fsm_event_post(E_SET_DONE, &data);

    sys_mm_free(mp_set_req->value);
    sys_mm_free(mp_set_req);
}

static void mcps_data_conf(mcps_data_conf_t * conf)
{
    fsm_event_data_t data =
    {
        .mcps_data_conf = conf
    };

    if (conf->status == MAC_SUCCESS)
    {
        tx_sequence_number++;
		bsp_board_led_invert(LED_CDC_ACM_TX);
        fsm_event_post(E_RADIO_TX_SUCCESS, &data);
	}
    else
    {
        fsm_event_post(E_RADIO_TX_NO_ACK, &data);
    }
    //fsm_event_post(E_RADIO_TX_DONE, &data);
    //LEDS_OFF(BIT(CONFIG_UPSTREAM_PIN));
}


/* storing functions */

