xiafuning/nrf52840-dongle-applications/wireless_usb_cdc_acm/fsm.c
static void mlme_set_conf_store(fsm_event_data_t * p_data)
{
    if (p_data != NULL)
    {
        m_set_conf = *p_data->mlme_set;
    }
}

static void mcps_data_ind_store(fsm_event_data_t * p_data)
{
    mcps_data_ind_t * p_frame = p_data->mcps_data_ind;
    fsm_frame_item_t fsm_frame;

    fsm_frame.payload_descr = p_frame->msdu;
    fsm_frame.length        = p_frame->msdu_length;
    frame_store(&fsm_frame);
}

static void mcps_data_conf_store(fsm_event_data_t * p_data)
{
    if (p_data != NULL)
        m_data_conf = *p_data->mcps_data_conf;
}

/* interface functions */

void fsm_init(void)
{
    sys_fsm_init(&m_fsm, &m_fsm_descriptor);
    m_radio_rx_array_read_index = 0;
    m_radio_rx_array_write_index = 0;
}

void fsm_event_post(fsm_events_t event, fsm_event_data_t * p_data)
{

    m_events |= BIT(event);
    if (event_data_store[event] != NULL)
    {
        event_data_store[event](p_data);
    }

    sys_task_post(APP_TASK_ID);
}

void fsm_event_scheduler_run(void)
{
    for (uint8_t event_id = 0; event_id < EVENTS_AMOUNT; event_id++)
    {
        uint16_t mask = BIT(event_id);
        if (m_events & mask)
        {
            m_events ^= mask;
            sys_fsm_event_post(&m_fsm, (fsm_events_t)event_id, NULL);
        }
    }

    if (m_events)
    {
        sys_task_post(APP_TASK_ID);
    }
}

//==========================================
// XFN_CHANGE
//==========================================


static void a_usb_cdc_acm_tx_start(void * p_data)
{
    ASSERT(frames_available());
    extern bool m_serial_frag_flag;

    fsm_frame_item_t * p_fsm_frame = next_frame_get();

	app_usbd_cdc_acm_t const * p_usb_cdc_acm = usb_cdc_acm_inst_get();

    if (need_serial_fragmentation (p_fsm_frame->length) == true)
    {
        m_serial_frag_flag = true;
        tx_buf_t* tx_buffer = serial_fragmentation (p_fsm_frame->payload_descr.p_payload,
                                                    p_fsm_frame->length);
        // send first fragment
        app_usbd_cdc_acm_write (p_usb_cdc_acm, tx_buffer->buf_0, 64);
    }
    else
	    app_usbd_cdc_acm_write(p_usb_cdc_acm,
						       p_fsm_frame->payload_descr.p_payload,
						       p_fsm_frame->length);

    mac_mem_msdu_free(&p_fsm_frame->payload_descr);

    m_usb_cdc_acm_tx_idle = false;

    //LEDS_ON(BIT(CONFIG_DOWNSTREAM_PIN));

    (void)p_data;
}

static void a_usb_cdc_acm_tx_idle_set(void * p_data)
{
	m_usb_cdc_acm_tx_idle = true;
}

static bool gu_usb_cdc_acm_tx_data_available(void * p_data)
{
    bool ret = frames_available();
    if (ret != true)
        m_usb_cdc_acm_tx_idle = true;
    return ret;
}

static bool gu_usb_cdc_acm_tx_idle(void * p_data)
{
    return m_usb_cdc_acm_tx_idle;
}

static bool gu_radio_max_retries(void * p_data)
{
    if (m_data_conf.msdu_handle >= MAC_MAX_RETRIES + 1)
        return true;
    else
        return false;
}

static void a_mcps_data_conf_send (void * p_data)
{
    // reset radio tx idle flag
    m_radio_tx_idle = true;
    app_usbd_cdc_acm_t const * p_usb_cdc_acm = usb_cdc_acm_inst_get();
    // reset tx buffer
    memset (m_data_conf_tx_buffer, 0, sizeof m_data_conf_tx_buffer);

    memcpy (m_data_conf_tx_buffer, &m_data_conf.status, 1);
    memcpy (m_data_conf_tx_buffer + 1, &m_data_conf.msdu_handle, 1);
	memcpy (m_data_conf_tx_buffer + 2, &m_data_req.msdu_handle, 1);
    // reset msdu handle, necessary
    m_data_req.msdu_handle = 0;

    app_usbd_cdc_acm_write(p_usb_cdc_acm,
						   m_data_conf_tx_buffer,
						   3);
}
